Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/clocks.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : CLOCKS
// Version        : 1
// Bus type       : apb
// =============================================================================
#ifndef _HARDWARE_REGS_CLOCKS_H
#define _HARDWARE_REGS_CLOCKS_H
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT0_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_GPOUT0_CTRL_OFFSET _u(0x00000000)
#define CLOCKS_CLK_GPOUT0_CTRL_BITS   _u(0x10131de0)
#define CLOCKS_CLK_GPOUT0_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT0_CTRL_ENABLED
// Description : clock generator is enabled
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_BITS   _u(0x10000000)
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_MSB    _u(28)
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_LSB    _u(28)
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT0_CTRL_NUDGE
// Description : An edge on this signal shifts the phase of the output by 1
//               cycle of the input clock
//               This can be done at any time
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_BITS   _u(0x00100000)
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_MSB    _u(20)
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_LSB    _u(20)
#define CLOCKS_CLK_GPOUT0_CTRL_NUDGE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT0_CTRL_PHASE
// Description : This delays the enable signal by up to 3 cycles of the input
//               clock
//               This must be set before the clock is enabled to have any effect
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_BITS   _u(0x00030000)
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_MSB    _u(17)
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_LSB    _u(16)
#define CLOCKS_CLK_GPOUT0_CTRL_PHASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT0_CTRL_DC50
// Description : Enables duty cycle correction for odd divisors, can be changed
//               on-the-fly
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_BITS   _u(0x00001000)
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_MSB    _u(12)
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_LSB    _u(12)
#define CLOCKS_CLK_GPOUT0_CTRL_DC50_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT0_CTRL_ENABLE
// Description : Starts and stops the clock generator cleanly
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_BITS   _u(0x00000800)
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_MSB    _u(11)
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_LSB    _u(11)
#define CLOCKS_CLK_GPOUT0_CTRL_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT0_CTRL_KILL
// Description : Asynchronously kills the clock generator, enable must be set
//               low before deasserting kill
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_BITS   _u(0x00000400)
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_MSB    _u(10)
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_LSB    _u(10)
#define CLOCKS_CLK_GPOUT0_CTRL_KILL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT0_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clksrc_pll_sys
//               0x1 -> clksrc_gpin0
//               0x2 -> clksrc_gpin1
//               0x3 -> clksrc_pll_usb
//               0x4 -> clksrc_pll_usb_primary_ref_opcg
//               0x5 -> rosc_clksrc
//               0x6 -> xosc_clksrc
//               0x7 -> lposc_clksrc
//               0x8 -> clk_sys
//               0x9 -> clk_usb
//               0xa -> clk_adc
//               0xb -> clk_ref
//               0xc -> clk_peri
//               0xd -> clk_hstx
//               0xe -> otp_clk2fc
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_BITS   _u(0x000001e0)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_MSB    _u(8)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS _u(0x0)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x1)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x2)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x3)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG _u(0x4)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_ROSC_CLKSRC _u(0x5)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_XOSC_CLKSRC _u(0x6)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC _u(0x7)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_SYS _u(0x8)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_USB _u(0x9)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_ADC _u(0xa)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_REF _u(0xb)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_PERI _u(0xc)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_CLK_HSTX _u(0xd)
#define CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_VALUE_OTP_CLK2FC _u(0xe)
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT0_DIV
#define CLOCKS_CLK_GPOUT0_DIV_OFFSET _u(0x00000004)
#define CLOCKS_CLK_GPOUT0_DIV_BITS   _u(0xffffffff)
#define CLOCKS_CLK_GPOUT0_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT0_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_GPOUT0_DIV_INT_RESET  _u(0x0001)
#define CLOCKS_CLK_GPOUT0_DIV_INT_BITS   _u(0xffff0000)
#define CLOCKS_CLK_GPOUT0_DIV_INT_MSB    _u(31)
#define CLOCKS_CLK_GPOUT0_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_GPOUT0_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT0_DIV_FRAC
// Description : Fractional component of the divisor, can be changed on-the-fly
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_RESET  _u(0x0000)
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_BITS   _u(0x0000ffff)
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_MSB    _u(15)
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_LSB    _u(0)
#define CLOCKS_CLK_GPOUT0_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT0_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               This slice does not have a glitchless mux (only the AUX_SRC
//               field is present, not SRC) so this register is hardwired to
//               0x1.
#define CLOCKS_CLK_GPOUT0_SELECTED_OFFSET _u(0x00000008)
#define CLOCKS_CLK_GPOUT0_SELECTED_BITS   _u(0x00000001)
#define CLOCKS_CLK_GPOUT0_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_GPOUT0_SELECTED_MSB    _u(0)
#define CLOCKS_CLK_GPOUT0_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_GPOUT0_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT1_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_GPOUT1_CTRL_OFFSET _u(0x0000000c)
#define CLOCKS_CLK_GPOUT1_CTRL_BITS   _u(0x10131de0)
#define CLOCKS_CLK_GPOUT1_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT1_CTRL_ENABLED
// Description : clock generator is enabled
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_BITS   _u(0x10000000)
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_MSB    _u(28)
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_LSB    _u(28)
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT1_CTRL_NUDGE
// Description : An edge on this signal shifts the phase of the output by 1
//               cycle of the input clock
//               This can be done at any time
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_BITS   _u(0x00100000)
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_MSB    _u(20)
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_LSB    _u(20)
#define CLOCKS_CLK_GPOUT1_CTRL_NUDGE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT1_CTRL_PHASE
// Description : This delays the enable signal by up to 3 cycles of the input
//               clock
//               This must be set before the clock is enabled to have any effect
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_BITS   _u(0x00030000)
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_MSB    _u(17)
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_LSB    _u(16)
#define CLOCKS_CLK_GPOUT1_CTRL_PHASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT1_CTRL_DC50
// Description : Enables duty cycle correction for odd divisors, can be changed
//               on-the-fly
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_BITS   _u(0x00001000)
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_MSB    _u(12)
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_LSB    _u(12)
#define CLOCKS_CLK_GPOUT1_CTRL_DC50_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT1_CTRL_ENABLE
// Description : Starts and stops the clock generator cleanly
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_BITS   _u(0x00000800)
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_MSB    _u(11)
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_LSB    _u(11)
#define CLOCKS_CLK_GPOUT1_CTRL_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT1_CTRL_KILL
// Description : Asynchronously kills the clock generator, enable must be set
//               low before deasserting kill
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_BITS   _u(0x00000400)
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_MSB    _u(10)
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_LSB    _u(10)
#define CLOCKS_CLK_GPOUT1_CTRL_KILL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT1_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clksrc_pll_sys
//               0x1 -> clksrc_gpin0
//               0x2 -> clksrc_gpin1
//               0x3 -> clksrc_pll_usb
//               0x4 -> clksrc_pll_usb_primary_ref_opcg
//               0x5 -> rosc_clksrc
//               0x6 -> xosc_clksrc
//               0x7 -> lposc_clksrc
//               0x8 -> clk_sys
//               0x9 -> clk_usb
//               0xa -> clk_adc
//               0xb -> clk_ref
//               0xc -> clk_peri
//               0xd -> clk_hstx
//               0xe -> otp_clk2fc
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_BITS   _u(0x000001e0)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_MSB    _u(8)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS _u(0x0)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x1)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x2)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x3)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG _u(0x4)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_ROSC_CLKSRC _u(0x5)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_XOSC_CLKSRC _u(0x6)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC _u(0x7)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_SYS _u(0x8)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_USB _u(0x9)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_ADC _u(0xa)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_REF _u(0xb)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_PERI _u(0xc)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_CLK_HSTX _u(0xd)
#define CLOCKS_CLK_GPOUT1_CTRL_AUXSRC_VALUE_OTP_CLK2FC _u(0xe)
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT1_DIV
#define CLOCKS_CLK_GPOUT1_DIV_OFFSET _u(0x00000010)
#define CLOCKS_CLK_GPOUT1_DIV_BITS   _u(0xffffffff)
#define CLOCKS_CLK_GPOUT1_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT1_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_GPOUT1_DIV_INT_RESET  _u(0x0001)
#define CLOCKS_CLK_GPOUT1_DIV_INT_BITS   _u(0xffff0000)
#define CLOCKS_CLK_GPOUT1_DIV_INT_MSB    _u(31)
#define CLOCKS_CLK_GPOUT1_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_GPOUT1_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT1_DIV_FRAC
// Description : Fractional component of the divisor, can be changed on-the-fly
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_RESET  _u(0x0000)
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_BITS   _u(0x0000ffff)
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_MSB    _u(15)
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_LSB    _u(0)
#define CLOCKS_CLK_GPOUT1_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT1_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               This slice does not have a glitchless mux (only the AUX_SRC
//               field is present, not SRC) so this register is hardwired to
//               0x1.
#define CLOCKS_CLK_GPOUT1_SELECTED_OFFSET _u(0x00000014)
#define CLOCKS_CLK_GPOUT1_SELECTED_BITS   _u(0x00000001)
#define CLOCKS_CLK_GPOUT1_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_GPOUT1_SELECTED_MSB    _u(0)
#define CLOCKS_CLK_GPOUT1_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_GPOUT1_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT2_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_GPOUT2_CTRL_OFFSET _u(0x00000018)
#define CLOCKS_CLK_GPOUT2_CTRL_BITS   _u(0x10131de0)
#define CLOCKS_CLK_GPOUT2_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT2_CTRL_ENABLED
// Description : clock generator is enabled
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_BITS   _u(0x10000000)
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_MSB    _u(28)
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_LSB    _u(28)
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT2_CTRL_NUDGE
// Description : An edge on this signal shifts the phase of the output by 1
//               cycle of the input clock
//               This can be done at any time
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_BITS   _u(0x00100000)
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_MSB    _u(20)
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_LSB    _u(20)
#define CLOCKS_CLK_GPOUT2_CTRL_NUDGE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT2_CTRL_PHASE
// Description : This delays the enable signal by up to 3 cycles of the input
//               clock
//               This must be set before the clock is enabled to have any effect
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_BITS   _u(0x00030000)
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_MSB    _u(17)
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_LSB    _u(16)
#define CLOCKS_CLK_GPOUT2_CTRL_PHASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT2_CTRL_DC50
// Description : Enables duty cycle correction for odd divisors, can be changed
//               on-the-fly
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_BITS   _u(0x00001000)
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_MSB    _u(12)
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_LSB    _u(12)
#define CLOCKS_CLK_GPOUT2_CTRL_DC50_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT2_CTRL_ENABLE
// Description : Starts and stops the clock generator cleanly
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_BITS   _u(0x00000800)
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_MSB    _u(11)
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_LSB    _u(11)
#define CLOCKS_CLK_GPOUT2_CTRL_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT2_CTRL_KILL
// Description : Asynchronously kills the clock generator, enable must be set
//               low before deasserting kill
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_BITS   _u(0x00000400)
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_MSB    _u(10)
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_LSB    _u(10)
#define CLOCKS_CLK_GPOUT2_CTRL_KILL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT2_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clksrc_pll_sys
//               0x1 -> clksrc_gpin0
//               0x2 -> clksrc_gpin1
//               0x3 -> clksrc_pll_usb
//               0x4 -> clksrc_pll_usb_primary_ref_opcg
//               0x5 -> rosc_clksrc_ph
//               0x6 -> xosc_clksrc
//               0x7 -> lposc_clksrc
//               0x8 -> clk_sys
//               0x9 -> clk_usb
//               0xa -> clk_adc
//               0xb -> clk_ref
//               0xc -> clk_peri
//               0xd -> clk_hstx
//               0xe -> otp_clk2fc
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_BITS   _u(0x000001e0)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_MSB    _u(8)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS _u(0x0)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x1)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x2)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x3)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG _u(0x4)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH _u(0x5)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_XOSC_CLKSRC _u(0x6)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC _u(0x7)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_SYS _u(0x8)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_USB _u(0x9)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_ADC _u(0xa)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_REF _u(0xb)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_PERI _u(0xc)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_CLK_HSTX _u(0xd)
#define CLOCKS_CLK_GPOUT2_CTRL_AUXSRC_VALUE_OTP_CLK2FC _u(0xe)
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT2_DIV
#define CLOCKS_CLK_GPOUT2_DIV_OFFSET _u(0x0000001c)
#define CLOCKS_CLK_GPOUT2_DIV_BITS   _u(0xffffffff)
#define CLOCKS_CLK_GPOUT2_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT2_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_GPOUT2_DIV_INT_RESET  _u(0x0001)
#define CLOCKS_CLK_GPOUT2_DIV_INT_BITS   _u(0xffff0000)
#define CLOCKS_CLK_GPOUT2_DIV_INT_MSB    _u(31)
#define CLOCKS_CLK_GPOUT2_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_GPOUT2_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT2_DIV_FRAC
// Description : Fractional component of the divisor, can be changed on-the-fly
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_RESET  _u(0x0000)
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_BITS   _u(0x0000ffff)
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_MSB    _u(15)
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_LSB    _u(0)
#define CLOCKS_CLK_GPOUT2_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT2_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               This slice does not have a glitchless mux (only the AUX_SRC
//               field is present, not SRC) so this register is hardwired to
//               0x1.
#define CLOCKS_CLK_GPOUT2_SELECTED_OFFSET _u(0x00000020)
#define CLOCKS_CLK_GPOUT2_SELECTED_BITS   _u(0x00000001)
#define CLOCKS_CLK_GPOUT2_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_GPOUT2_SELECTED_MSB    _u(0)
#define CLOCKS_CLK_GPOUT2_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_GPOUT2_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT3_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_GPOUT3_CTRL_OFFSET _u(0x00000024)
#define CLOCKS_CLK_GPOUT3_CTRL_BITS   _u(0x10131de0)
#define CLOCKS_CLK_GPOUT3_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT3_CTRL_ENABLED
// Description : clock generator is enabled
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_BITS   _u(0x10000000)
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_MSB    _u(28)
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_LSB    _u(28)
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT3_CTRL_NUDGE
// Description : An edge on this signal shifts the phase of the output by 1
//               cycle of the input clock
//               This can be done at any time
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_BITS   _u(0x00100000)
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_MSB    _u(20)
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_LSB    _u(20)
#define CLOCKS_CLK_GPOUT3_CTRL_NUDGE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT3_CTRL_PHASE
// Description : This delays the enable signal by up to 3 cycles of the input
//               clock
//               This must be set before the clock is enabled to have any effect
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_RESET  _u(0x0)
