Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/clocks.h
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_BITS   _u(0x00030000)
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_MSB    _u(17)
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_LSB    _u(16)
#define CLOCKS_CLK_GPOUT3_CTRL_PHASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT3_CTRL_DC50
// Description : Enables duty cycle correction for odd divisors, can be changed
//               on-the-fly
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_BITS   _u(0x00001000)
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_MSB    _u(12)
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_LSB    _u(12)
#define CLOCKS_CLK_GPOUT3_CTRL_DC50_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT3_CTRL_ENABLE
// Description : Starts and stops the clock generator cleanly
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_BITS   _u(0x00000800)
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_MSB    _u(11)
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_LSB    _u(11)
#define CLOCKS_CLK_GPOUT3_CTRL_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT3_CTRL_KILL
// Description : Asynchronously kills the clock generator, enable must be set
//               low before deasserting kill
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_BITS   _u(0x00000400)
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_MSB    _u(10)
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_LSB    _u(10)
#define CLOCKS_CLK_GPOUT3_CTRL_KILL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT3_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clksrc_pll_sys
//               0x1 -> clksrc_gpin0
//               0x2 -> clksrc_gpin1
//               0x3 -> clksrc_pll_usb
//               0x4 -> clksrc_pll_usb_primary_ref_opcg
//               0x5 -> rosc_clksrc_ph
//               0x6 -> xosc_clksrc
//               0x7 -> lposc_clksrc
//               0x8 -> clk_sys
//               0x9 -> clk_usb
//               0xa -> clk_adc
//               0xb -> clk_ref
//               0xc -> clk_peri
//               0xd -> clk_hstx
//               0xe -> otp_clk2fc
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_RESET  _u(0x0)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_BITS   _u(0x000001e0)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_MSB    _u(8)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS _u(0x0)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x1)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x2)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x3)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG _u(0x4)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH _u(0x5)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_XOSC_CLKSRC _u(0x6)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_LPOSC_CLKSRC _u(0x7)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_SYS _u(0x8)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_USB _u(0x9)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_ADC _u(0xa)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_REF _u(0xb)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_PERI _u(0xc)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_CLK_HSTX _u(0xd)
#define CLOCKS_CLK_GPOUT3_CTRL_AUXSRC_VALUE_OTP_CLK2FC _u(0xe)
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT3_DIV
#define CLOCKS_CLK_GPOUT3_DIV_OFFSET _u(0x00000028)
#define CLOCKS_CLK_GPOUT3_DIV_BITS   _u(0xffffffff)
#define CLOCKS_CLK_GPOUT3_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT3_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_GPOUT3_DIV_INT_RESET  _u(0x0001)
#define CLOCKS_CLK_GPOUT3_DIV_INT_BITS   _u(0xffff0000)
#define CLOCKS_CLK_GPOUT3_DIV_INT_MSB    _u(31)
#define CLOCKS_CLK_GPOUT3_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_GPOUT3_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_GPOUT3_DIV_FRAC
// Description : Fractional component of the divisor, can be changed on-the-fly
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_RESET  _u(0x0000)
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_BITS   _u(0x0000ffff)
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_MSB    _u(15)
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_LSB    _u(0)
#define CLOCKS_CLK_GPOUT3_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_GPOUT3_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               This slice does not have a glitchless mux (only the AUX_SRC
//               field is present, not SRC) so this register is hardwired to
//               0x1.
#define CLOCKS_CLK_GPOUT3_SELECTED_OFFSET _u(0x0000002c)
#define CLOCKS_CLK_GPOUT3_SELECTED_BITS   _u(0x00000001)
#define CLOCKS_CLK_GPOUT3_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_GPOUT3_SELECTED_MSB    _u(0)
#define CLOCKS_CLK_GPOUT3_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_GPOUT3_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_CLK_REF_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_REF_CTRL_OFFSET _u(0x00000030)
#define CLOCKS_CLK_REF_CTRL_BITS   _u(0x00000063)
#define CLOCKS_CLK_REF_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_REF_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clksrc_pll_usb
//               0x1 -> clksrc_gpin0
//               0x2 -> clksrc_gpin1
//               0x3 -> clksrc_pll_usb_primary_ref_opcg
#define CLOCKS_CLK_REF_CTRL_AUXSRC_RESET  _u(0x0)
#define CLOCKS_CLK_REF_CTRL_AUXSRC_BITS   _u(0x00000060)
#define CLOCKS_CLK_REF_CTRL_AUXSRC_MSB    _u(6)
#define CLOCKS_CLK_REF_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_REF_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x0)
#define CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x1)
#define CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x2)
#define CLOCKS_CLK_REF_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB_PRIMARY_REF_OPCG _u(0x3)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_REF_CTRL_SRC
// Description : Selects the clock source glitchlessly, can be changed on-the-
//               fly
//               0x0 -> rosc_clksrc_ph
//               0x1 -> clksrc_clk_ref_aux
//               0x2 -> xosc_clksrc
//               0x3 -> lposc_clksrc
#define CLOCKS_CLK_REF_CTRL_SRC_RESET  "-"
#define CLOCKS_CLK_REF_CTRL_SRC_BITS   _u(0x00000003)
#define CLOCKS_CLK_REF_CTRL_SRC_MSB    _u(1)
#define CLOCKS_CLK_REF_CTRL_SRC_LSB    _u(0)
#define CLOCKS_CLK_REF_CTRL_SRC_ACCESS "RW"
#define CLOCKS_CLK_REF_CTRL_SRC_VALUE_ROSC_CLKSRC_PH _u(0x0)
#define CLOCKS_CLK_REF_CTRL_SRC_VALUE_CLKSRC_CLK_REF_AUX _u(0x1)
#define CLOCKS_CLK_REF_CTRL_SRC_VALUE_XOSC_CLKSRC _u(0x2)
#define CLOCKS_CLK_REF_CTRL_SRC_VALUE_LPOSC_CLKSRC _u(0x3)
// =============================================================================
// Register    : CLOCKS_CLK_REF_DIV
#define CLOCKS_CLK_REF_DIV_OFFSET _u(0x00000034)
#define CLOCKS_CLK_REF_DIV_BITS   _u(0x00ff0000)
#define CLOCKS_CLK_REF_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_REF_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_REF_DIV_INT_RESET  _u(0x01)
#define CLOCKS_CLK_REF_DIV_INT_BITS   _u(0x00ff0000)
#define CLOCKS_CLK_REF_DIV_INT_MSB    _u(23)
#define CLOCKS_CLK_REF_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_REF_DIV_INT_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_REF_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               The glitchless multiplexer does not switch instantaneously (to
//               avoid glitches), so software should poll this register to wait
//               for the switch to complete. This register contains one decoded
//               bit for each of the clock sources enumerated in the CTRL SRC
//               field. At most one of these bits will be set at any time,
//               indicating that clock is currently present at the output of the
//               glitchless mux. Whilst switching is in progress, this register
//               may briefly show all-0s.
#define CLOCKS_CLK_REF_SELECTED_OFFSET _u(0x00000038)
#define CLOCKS_CLK_REF_SELECTED_BITS   _u(0x0000000f)
#define CLOCKS_CLK_REF_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_REF_SELECTED_MSB    _u(3)
#define CLOCKS_CLK_REF_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_REF_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_CLK_SYS_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_SYS_CTRL_OFFSET _u(0x0000003c)
#define CLOCKS_CLK_SYS_CTRL_BITS   _u(0x000000e1)
#define CLOCKS_CLK_SYS_CTRL_RESET  _u(0x00000041)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_SYS_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clksrc_pll_sys
//               0x1 -> clksrc_pll_usb
//               0x2 -> rosc_clksrc
//               0x3 -> xosc_clksrc
//               0x4 -> clksrc_gpin0
//               0x5 -> clksrc_gpin1
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_RESET  _u(0x2)
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_BITS   _u(0x000000e0)
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_MSB    _u(7)
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS _u(0x0)
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x1)
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_ROSC_CLKSRC _u(0x2)
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_XOSC_CLKSRC _u(0x3)
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x4)
#define CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x5)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_SYS_CTRL_SRC
// Description : Selects the clock source glitchlessly, can be changed on-the-
//               fly
//               0x0 -> clk_ref
//               0x1 -> clksrc_clk_sys_aux
#define CLOCKS_CLK_SYS_CTRL_SRC_RESET  _u(0x1)
#define CLOCKS_CLK_SYS_CTRL_SRC_BITS   _u(0x00000001)
#define CLOCKS_CLK_SYS_CTRL_SRC_MSB    _u(0)
#define CLOCKS_CLK_SYS_CTRL_SRC_LSB    _u(0)
#define CLOCKS_CLK_SYS_CTRL_SRC_ACCESS "RW"
#define CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLK_REF _u(0x0)
#define CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX _u(0x1)
// =============================================================================
// Register    : CLOCKS_CLK_SYS_DIV
#define CLOCKS_CLK_SYS_DIV_OFFSET _u(0x00000040)
#define CLOCKS_CLK_SYS_DIV_BITS   _u(0xffffffff)
#define CLOCKS_CLK_SYS_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_SYS_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_SYS_DIV_INT_RESET  _u(0x0001)
#define CLOCKS_CLK_SYS_DIV_INT_BITS   _u(0xffff0000)
#define CLOCKS_CLK_SYS_DIV_INT_MSB    _u(31)
#define CLOCKS_CLK_SYS_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_SYS_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_SYS_DIV_FRAC
// Description : Fractional component of the divisor, can be changed on-the-fly
#define CLOCKS_CLK_SYS_DIV_FRAC_RESET  _u(0x0000)
#define CLOCKS_CLK_SYS_DIV_FRAC_BITS   _u(0x0000ffff)
#define CLOCKS_CLK_SYS_DIV_FRAC_MSB    _u(15)
#define CLOCKS_CLK_SYS_DIV_FRAC_LSB    _u(0)
#define CLOCKS_CLK_SYS_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_SYS_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               The glitchless multiplexer does not switch instantaneously (to
//               avoid glitches), so software should poll this register to wait
//               for the switch to complete. This register contains one decoded
//               bit for each of the clock sources enumerated in the CTRL SRC
//               field. At most one of these bits will be set at any time,
//               indicating that clock is currently present at the output of the
//               glitchless mux. Whilst switching is in progress, this register
//               may briefly show all-0s.
#define CLOCKS_CLK_SYS_SELECTED_OFFSET _u(0x00000044)
#define CLOCKS_CLK_SYS_SELECTED_BITS   _u(0x00000003)
#define CLOCKS_CLK_SYS_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_SYS_SELECTED_MSB    _u(1)
#define CLOCKS_CLK_SYS_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_SYS_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_CLK_PERI_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_PERI_CTRL_OFFSET _u(0x00000048)
#define CLOCKS_CLK_PERI_CTRL_BITS   _u(0x10000ce0)
#define CLOCKS_CLK_PERI_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_PERI_CTRL_ENABLED
// Description : clock generator is enabled
#define CLOCKS_CLK_PERI_CTRL_ENABLED_RESET  _u(0x0)
#define CLOCKS_CLK_PERI_CTRL_ENABLED_BITS   _u(0x10000000)
#define CLOCKS_CLK_PERI_CTRL_ENABLED_MSB    _u(28)
#define CLOCKS_CLK_PERI_CTRL_ENABLED_LSB    _u(28)
#define CLOCKS_CLK_PERI_CTRL_ENABLED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_PERI_CTRL_ENABLE
// Description : Starts and stops the clock generator cleanly
#define CLOCKS_CLK_PERI_CTRL_ENABLE_RESET  _u(0x0)
#define CLOCKS_CLK_PERI_CTRL_ENABLE_BITS   _u(0x00000800)
#define CLOCKS_CLK_PERI_CTRL_ENABLE_MSB    _u(11)
#define CLOCKS_CLK_PERI_CTRL_ENABLE_LSB    _u(11)
#define CLOCKS_CLK_PERI_CTRL_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_PERI_CTRL_KILL
// Description : Asynchronously kills the clock generator, enable must be set
//               low before deasserting kill
#define CLOCKS_CLK_PERI_CTRL_KILL_RESET  _u(0x0)
#define CLOCKS_CLK_PERI_CTRL_KILL_BITS   _u(0x00000400)
#define CLOCKS_CLK_PERI_CTRL_KILL_MSB    _u(10)
#define CLOCKS_CLK_PERI_CTRL_KILL_LSB    _u(10)
#define CLOCKS_CLK_PERI_CTRL_KILL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_PERI_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clk_sys
//               0x1 -> clksrc_pll_sys
//               0x2 -> clksrc_pll_usb
//               0x3 -> rosc_clksrc_ph
//               0x4 -> xosc_clksrc
//               0x5 -> clksrc_gpin0
//               0x6 -> clksrc_gpin1
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_RESET  _u(0x0)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_BITS   _u(0x000000e0)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_MSB    _u(7)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLK_SYS _u(0x0)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS _u(0x1)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x2)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH _u(0x3)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_XOSC_CLKSRC _u(0x4)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x5)
#define CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x6)
// =============================================================================
// Register    : CLOCKS_CLK_PERI_DIV
#define CLOCKS_CLK_PERI_DIV_OFFSET _u(0x0000004c)
#define CLOCKS_CLK_PERI_DIV_BITS   _u(0x00030000)
#define CLOCKS_CLK_PERI_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_PERI_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_PERI_DIV_INT_RESET  _u(0x1)
#define CLOCKS_CLK_PERI_DIV_INT_BITS   _u(0x00030000)
#define CLOCKS_CLK_PERI_DIV_INT_MSB    _u(17)
#define CLOCKS_CLK_PERI_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_PERI_DIV_INT_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_PERI_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               This slice does not have a glitchless mux (only the AUX_SRC
//               field is present, not SRC) so this register is hardwired to
//               0x1.
#define CLOCKS_CLK_PERI_SELECTED_OFFSET _u(0x00000050)
#define CLOCKS_CLK_PERI_SELECTED_BITS   _u(0x00000001)
#define CLOCKS_CLK_PERI_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_PERI_SELECTED_MSB    _u(0)
#define CLOCKS_CLK_PERI_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_PERI_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_CLK_HSTX_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_HSTX_CTRL_OFFSET _u(0x00000054)
#define CLOCKS_CLK_HSTX_CTRL_BITS   _u(0x10130ce0)
#define CLOCKS_CLK_HSTX_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_HSTX_CTRL_ENABLED
// Description : clock generator is enabled
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_RESET  _u(0x0)
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_BITS   _u(0x10000000)
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_MSB    _u(28)
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_LSB    _u(28)
#define CLOCKS_CLK_HSTX_CTRL_ENABLED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_HSTX_CTRL_NUDGE
// Description : An edge on this signal shifts the phase of the output by 1
//               cycle of the input clock
//               This can be done at any time
#define CLOCKS_CLK_HSTX_CTRL_NUDGE_RESET  _u(0x0)
#define CLOCKS_CLK_HSTX_CTRL_NUDGE_BITS   _u(0x00100000)
#define CLOCKS_CLK_HSTX_CTRL_NUDGE_MSB    _u(20)
#define CLOCKS_CLK_HSTX_CTRL_NUDGE_LSB    _u(20)
#define CLOCKS_CLK_HSTX_CTRL_NUDGE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_HSTX_CTRL_PHASE
// Description : This delays the enable signal by up to 3 cycles of the input
//               clock
//               This must be set before the clock is enabled to have any effect
#define CLOCKS_CLK_HSTX_CTRL_PHASE_RESET  _u(0x0)
#define CLOCKS_CLK_HSTX_CTRL_PHASE_BITS   _u(0x00030000)
#define CLOCKS_CLK_HSTX_CTRL_PHASE_MSB    _u(17)
#define CLOCKS_CLK_HSTX_CTRL_PHASE_LSB    _u(16)
#define CLOCKS_CLK_HSTX_CTRL_PHASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_HSTX_CTRL_ENABLE
// Description : Starts and stops the clock generator cleanly
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_RESET  _u(0x0)
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_BITS   _u(0x00000800)
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_MSB    _u(11)
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_LSB    _u(11)
#define CLOCKS_CLK_HSTX_CTRL_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_HSTX_CTRL_KILL
// Description : Asynchronously kills the clock generator, enable must be set
//               low before deasserting kill
#define CLOCKS_CLK_HSTX_CTRL_KILL_RESET  _u(0x0)
#define CLOCKS_CLK_HSTX_CTRL_KILL_BITS   _u(0x00000400)
#define CLOCKS_CLK_HSTX_CTRL_KILL_MSB    _u(10)
#define CLOCKS_CLK_HSTX_CTRL_KILL_LSB    _u(10)
#define CLOCKS_CLK_HSTX_CTRL_KILL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_HSTX_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clk_sys
//               0x1 -> clksrc_pll_sys
//               0x2 -> clksrc_pll_usb
//               0x3 -> clksrc_gpin0
//               0x4 -> clksrc_gpin1
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_RESET  _u(0x0)
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_BITS   _u(0x000000e0)
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_MSB    _u(7)
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLK_SYS _u(0x0)
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS _u(0x1)
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x2)
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x3)
#define CLOCKS_CLK_HSTX_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x4)
// =============================================================================
// Register    : CLOCKS_CLK_HSTX_DIV
#define CLOCKS_CLK_HSTX_DIV_OFFSET _u(0x00000058)
#define CLOCKS_CLK_HSTX_DIV_BITS   _u(0x00030000)
#define CLOCKS_CLK_HSTX_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_HSTX_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_HSTX_DIV_INT_RESET  _u(0x1)
#define CLOCKS_CLK_HSTX_DIV_INT_BITS   _u(0x00030000)
#define CLOCKS_CLK_HSTX_DIV_INT_MSB    _u(17)
#define CLOCKS_CLK_HSTX_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_HSTX_DIV_INT_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_HSTX_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               This slice does not have a glitchless mux (only the AUX_SRC
//               field is present, not SRC) so this register is hardwired to
//               0x1.
#define CLOCKS_CLK_HSTX_SELECTED_OFFSET _u(0x0000005c)
#define CLOCKS_CLK_HSTX_SELECTED_BITS   _u(0x00000001)
#define CLOCKS_CLK_HSTX_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_HSTX_SELECTED_MSB    _u(0)
#define CLOCKS_CLK_HSTX_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_HSTX_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_CLK_USB_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_USB_CTRL_OFFSET _u(0x00000060)
#define CLOCKS_CLK_USB_CTRL_BITS   _u(0x10130ce0)
#define CLOCKS_CLK_USB_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_USB_CTRL_ENABLED
// Description : clock generator is enabled
#define CLOCKS_CLK_USB_CTRL_ENABLED_RESET  _u(0x0)
#define CLOCKS_CLK_USB_CTRL_ENABLED_BITS   _u(0x10000000)
#define CLOCKS_CLK_USB_CTRL_ENABLED_MSB    _u(28)
#define CLOCKS_CLK_USB_CTRL_ENABLED_LSB    _u(28)
#define CLOCKS_CLK_USB_CTRL_ENABLED_ACCESS "RO"
