Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/clocks.h
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_USB_CTRL_NUDGE
// Description : An edge on this signal shifts the phase of the output by 1
//               cycle of the input clock
//               This can be done at any time
#define CLOCKS_CLK_USB_CTRL_NUDGE_RESET  _u(0x0)
#define CLOCKS_CLK_USB_CTRL_NUDGE_BITS   _u(0x00100000)
#define CLOCKS_CLK_USB_CTRL_NUDGE_MSB    _u(20)
#define CLOCKS_CLK_USB_CTRL_NUDGE_LSB    _u(20)
#define CLOCKS_CLK_USB_CTRL_NUDGE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_USB_CTRL_PHASE
// Description : This delays the enable signal by up to 3 cycles of the input
//               clock
//               This must be set before the clock is enabled to have any effect
#define CLOCKS_CLK_USB_CTRL_PHASE_RESET  _u(0x0)
#define CLOCKS_CLK_USB_CTRL_PHASE_BITS   _u(0x00030000)
#define CLOCKS_CLK_USB_CTRL_PHASE_MSB    _u(17)
#define CLOCKS_CLK_USB_CTRL_PHASE_LSB    _u(16)
#define CLOCKS_CLK_USB_CTRL_PHASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_USB_CTRL_ENABLE
// Description : Starts and stops the clock generator cleanly
#define CLOCKS_CLK_USB_CTRL_ENABLE_RESET  _u(0x0)
#define CLOCKS_CLK_USB_CTRL_ENABLE_BITS   _u(0x00000800)
#define CLOCKS_CLK_USB_CTRL_ENABLE_MSB    _u(11)
#define CLOCKS_CLK_USB_CTRL_ENABLE_LSB    _u(11)
#define CLOCKS_CLK_USB_CTRL_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_USB_CTRL_KILL
// Description : Asynchronously kills the clock generator, enable must be set
//               low before deasserting kill
#define CLOCKS_CLK_USB_CTRL_KILL_RESET  _u(0x0)
#define CLOCKS_CLK_USB_CTRL_KILL_BITS   _u(0x00000400)
#define CLOCKS_CLK_USB_CTRL_KILL_MSB    _u(10)
#define CLOCKS_CLK_USB_CTRL_KILL_LSB    _u(10)
#define CLOCKS_CLK_USB_CTRL_KILL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_USB_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clksrc_pll_usb
//               0x1 -> clksrc_pll_sys
//               0x2 -> rosc_clksrc_ph
//               0x3 -> xosc_clksrc
//               0x4 -> clksrc_gpin0
//               0x5 -> clksrc_gpin1
#define CLOCKS_CLK_USB_CTRL_AUXSRC_RESET  _u(0x0)
#define CLOCKS_CLK_USB_CTRL_AUXSRC_BITS   _u(0x000000e0)
#define CLOCKS_CLK_USB_CTRL_AUXSRC_MSB    _u(7)
#define CLOCKS_CLK_USB_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_USB_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x0)
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS _u(0x1)
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH _u(0x2)
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_XOSC_CLKSRC _u(0x3)
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x4)
#define CLOCKS_CLK_USB_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x5)
// =============================================================================
// Register    : CLOCKS_CLK_USB_DIV
#define CLOCKS_CLK_USB_DIV_OFFSET _u(0x00000064)
#define CLOCKS_CLK_USB_DIV_BITS   _u(0x000f0000)
#define CLOCKS_CLK_USB_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_USB_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_USB_DIV_INT_RESET  _u(0x1)
#define CLOCKS_CLK_USB_DIV_INT_BITS   _u(0x000f0000)
#define CLOCKS_CLK_USB_DIV_INT_MSB    _u(19)
#define CLOCKS_CLK_USB_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_USB_DIV_INT_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_USB_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               This slice does not have a glitchless mux (only the AUX_SRC
//               field is present, not SRC) so this register is hardwired to
//               0x1.
#define CLOCKS_CLK_USB_SELECTED_OFFSET _u(0x00000068)
#define CLOCKS_CLK_USB_SELECTED_BITS   _u(0x00000001)
#define CLOCKS_CLK_USB_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_USB_SELECTED_MSB    _u(0)
#define CLOCKS_CLK_USB_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_USB_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_CLK_ADC_CTRL
// Description : Clock control, can be changed on-the-fly (except for auxsrc)
#define CLOCKS_CLK_ADC_CTRL_OFFSET _u(0x0000006c)
#define CLOCKS_CLK_ADC_CTRL_BITS   _u(0x10130ce0)
#define CLOCKS_CLK_ADC_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_ADC_CTRL_ENABLED
// Description : clock generator is enabled
#define CLOCKS_CLK_ADC_CTRL_ENABLED_RESET  _u(0x0)
#define CLOCKS_CLK_ADC_CTRL_ENABLED_BITS   _u(0x10000000)
#define CLOCKS_CLK_ADC_CTRL_ENABLED_MSB    _u(28)
#define CLOCKS_CLK_ADC_CTRL_ENABLED_LSB    _u(28)
#define CLOCKS_CLK_ADC_CTRL_ENABLED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_ADC_CTRL_NUDGE
// Description : An edge on this signal shifts the phase of the output by 1
//               cycle of the input clock
//               This can be done at any time
#define CLOCKS_CLK_ADC_CTRL_NUDGE_RESET  _u(0x0)
#define CLOCKS_CLK_ADC_CTRL_NUDGE_BITS   _u(0x00100000)
#define CLOCKS_CLK_ADC_CTRL_NUDGE_MSB    _u(20)
#define CLOCKS_CLK_ADC_CTRL_NUDGE_LSB    _u(20)
#define CLOCKS_CLK_ADC_CTRL_NUDGE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_ADC_CTRL_PHASE
// Description : This delays the enable signal by up to 3 cycles of the input
//               clock
//               This must be set before the clock is enabled to have any effect
#define CLOCKS_CLK_ADC_CTRL_PHASE_RESET  _u(0x0)
#define CLOCKS_CLK_ADC_CTRL_PHASE_BITS   _u(0x00030000)
#define CLOCKS_CLK_ADC_CTRL_PHASE_MSB    _u(17)
#define CLOCKS_CLK_ADC_CTRL_PHASE_LSB    _u(16)
#define CLOCKS_CLK_ADC_CTRL_PHASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_ADC_CTRL_ENABLE
// Description : Starts and stops the clock generator cleanly
#define CLOCKS_CLK_ADC_CTRL_ENABLE_RESET  _u(0x0)
#define CLOCKS_CLK_ADC_CTRL_ENABLE_BITS   _u(0x00000800)
#define CLOCKS_CLK_ADC_CTRL_ENABLE_MSB    _u(11)
#define CLOCKS_CLK_ADC_CTRL_ENABLE_LSB    _u(11)
#define CLOCKS_CLK_ADC_CTRL_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_ADC_CTRL_KILL
// Description : Asynchronously kills the clock generator, enable must be set
//               low before deasserting kill
#define CLOCKS_CLK_ADC_CTRL_KILL_RESET  _u(0x0)
#define CLOCKS_CLK_ADC_CTRL_KILL_BITS   _u(0x00000400)
#define CLOCKS_CLK_ADC_CTRL_KILL_MSB    _u(10)
#define CLOCKS_CLK_ADC_CTRL_KILL_LSB    _u(10)
#define CLOCKS_CLK_ADC_CTRL_KILL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_ADC_CTRL_AUXSRC
// Description : Selects the auxiliary clock source, will glitch when switching
//               0x0 -> clksrc_pll_usb
//               0x1 -> clksrc_pll_sys
//               0x2 -> rosc_clksrc_ph
//               0x3 -> xosc_clksrc
//               0x4 -> clksrc_gpin0
//               0x5 -> clksrc_gpin1
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_RESET  _u(0x0)
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_BITS   _u(0x000000e0)
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_MSB    _u(7)
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_LSB    _u(5)
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_ACCESS "RW"
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB _u(0x0)
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS _u(0x1)
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH _u(0x2)
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_XOSC_CLKSRC _u(0x3)
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_GPIN0 _u(0x4)
#define CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_CLKSRC_GPIN1 _u(0x5)
// =============================================================================
// Register    : CLOCKS_CLK_ADC_DIV
#define CLOCKS_CLK_ADC_DIV_OFFSET _u(0x00000070)
#define CLOCKS_CLK_ADC_DIV_BITS   _u(0x000f0000)
#define CLOCKS_CLK_ADC_DIV_RESET  _u(0x00010000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_ADC_DIV_INT
// Description : Integer part of clock divisor, 0 -> max+1, can be changed on-
//               the-fly
#define CLOCKS_CLK_ADC_DIV_INT_RESET  _u(0x1)
#define CLOCKS_CLK_ADC_DIV_INT_BITS   _u(0x000f0000)
#define CLOCKS_CLK_ADC_DIV_INT_MSB    _u(19)
#define CLOCKS_CLK_ADC_DIV_INT_LSB    _u(16)
#define CLOCKS_CLK_ADC_DIV_INT_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_ADC_SELECTED
// Description : Indicates which src is currently selected (one-hot)
//               This slice does not have a glitchless mux (only the AUX_SRC
//               field is present, not SRC) so this register is hardwired to
//               0x1.
#define CLOCKS_CLK_ADC_SELECTED_OFFSET _u(0x00000074)
#define CLOCKS_CLK_ADC_SELECTED_BITS   _u(0x00000001)
#define CLOCKS_CLK_ADC_SELECTED_RESET  _u(0x00000001)
#define CLOCKS_CLK_ADC_SELECTED_MSB    _u(0)
#define CLOCKS_CLK_ADC_SELECTED_LSB    _u(0)
#define CLOCKS_CLK_ADC_SELECTED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_DFTCLK_XOSC_CTRL
#define CLOCKS_DFTCLK_XOSC_CTRL_OFFSET _u(0x00000078)
#define CLOCKS_DFTCLK_XOSC_CTRL_BITS   _u(0x00000003)
#define CLOCKS_DFTCLK_XOSC_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_DFTCLK_XOSC_CTRL_SRC
//               0x0 -> NULL
//               0x1 -> clksrc_pll_usb_primary
//               0x2 -> clksrc_gpin0
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_RESET  _u(0x0)
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_BITS   _u(0x00000003)
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_MSB    _u(1)
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_LSB    _u(0)
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_ACCESS "RW"
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_VALUE_NULL _u(0x0)
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_VALUE_CLKSRC_PLL_USB_PRIMARY _u(0x1)
#define CLOCKS_DFTCLK_XOSC_CTRL_SRC_VALUE_CLKSRC_GPIN0 _u(0x2)
// =============================================================================
// Register    : CLOCKS_DFTCLK_ROSC_CTRL
#define CLOCKS_DFTCLK_ROSC_CTRL_OFFSET _u(0x0000007c)
#define CLOCKS_DFTCLK_ROSC_CTRL_BITS   _u(0x00000003)
#define CLOCKS_DFTCLK_ROSC_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_DFTCLK_ROSC_CTRL_SRC
//               0x0 -> NULL
//               0x1 -> clksrc_pll_sys_primary_rosc
//               0x2 -> clksrc_gpin1
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_RESET  _u(0x0)
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_BITS   _u(0x00000003)
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_MSB    _u(1)
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_LSB    _u(0)
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_ACCESS "RW"
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_VALUE_NULL _u(0x0)
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_VALUE_CLKSRC_PLL_SYS_PRIMARY_ROSC _u(0x1)
#define CLOCKS_DFTCLK_ROSC_CTRL_SRC_VALUE_CLKSRC_GPIN1 _u(0x2)
// =============================================================================
// Register    : CLOCKS_DFTCLK_LPOSC_CTRL
#define CLOCKS_DFTCLK_LPOSC_CTRL_OFFSET _u(0x00000080)
#define CLOCKS_DFTCLK_LPOSC_CTRL_BITS   _u(0x00000003)
#define CLOCKS_DFTCLK_LPOSC_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_DFTCLK_LPOSC_CTRL_SRC
//               0x0 -> NULL
//               0x1 -> clksrc_pll_usb_primary_lposc
//               0x2 -> clksrc_gpin1
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_RESET  _u(0x0)
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_BITS   _u(0x00000003)
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_MSB    _u(1)
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_LSB    _u(0)
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_ACCESS "RW"
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_VALUE_NULL _u(0x0)
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_VALUE_CLKSRC_PLL_USB_PRIMARY_LPOSC _u(0x1)
#define CLOCKS_DFTCLK_LPOSC_CTRL_SRC_VALUE_CLKSRC_GPIN1 _u(0x2)
// =============================================================================
// Register    : CLOCKS_CLK_SYS_RESUS_CTRL
#define CLOCKS_CLK_SYS_RESUS_CTRL_OFFSET _u(0x00000084)
#define CLOCKS_CLK_SYS_RESUS_CTRL_BITS   _u(0x000111ff)
#define CLOCKS_CLK_SYS_RESUS_CTRL_RESET  _u(0x000000ff)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR
// Description : For clearing the resus after the fault that triggered it has
//               been corrected
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_RESET  _u(0x0)
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_BITS   _u(0x00010000)
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_MSB    _u(16)
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_LSB    _u(16)
#define CLOCKS_CLK_SYS_RESUS_CTRL_CLEAR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_SYS_RESUS_CTRL_FRCE
// Description : Force a resus, for test purposes only
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_RESET  _u(0x0)
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_BITS   _u(0x00001000)
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_MSB    _u(12)
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_LSB    _u(12)
#define CLOCKS_CLK_SYS_RESUS_CTRL_FRCE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE
// Description : Enable resus
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_RESET  _u(0x0)
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_BITS   _u(0x00000100)
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_MSB    _u(8)
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_LSB    _u(8)
#define CLOCKS_CLK_SYS_RESUS_CTRL_ENABLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT
// Description : This is expressed as a number of clk_ref cycles
//               and must be >= 2x clk_ref_freq/min_clk_tst_freq
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_RESET  _u(0xff)
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_BITS   _u(0x000000ff)
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_MSB    _u(7)
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_LSB    _u(0)
#define CLOCKS_CLK_SYS_RESUS_CTRL_TIMEOUT_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_CLK_SYS_RESUS_STATUS
#define CLOCKS_CLK_SYS_RESUS_STATUS_OFFSET _u(0x00000088)
#define CLOCKS_CLK_SYS_RESUS_STATUS_BITS   _u(0x00000001)
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED
// Description : Clock has been resuscitated, correct the error then send
//               ctrl_clear=1
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_RESET  _u(0x0)
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_BITS   _u(0x00000001)
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_MSB    _u(0)
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_LSB    _u(0)
#define CLOCKS_CLK_SYS_RESUS_STATUS_RESUSSED_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_FC0_REF_KHZ
// Description : Reference clock frequency in kHz
#define CLOCKS_FC0_REF_KHZ_OFFSET _u(0x0000008c)
#define CLOCKS_FC0_REF_KHZ_BITS   _u(0x000fffff)
#define CLOCKS_FC0_REF_KHZ_RESET  _u(0x00000000)
#define CLOCKS_FC0_REF_KHZ_MSB    _u(19)
#define CLOCKS_FC0_REF_KHZ_LSB    _u(0)
#define CLOCKS_FC0_REF_KHZ_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_FC0_MIN_KHZ
// Description : Minimum pass frequency in kHz. This is optional. Set to 0 if
//               you are not using the pass/fail flags
#define CLOCKS_FC0_MIN_KHZ_OFFSET _u(0x00000090)
#define CLOCKS_FC0_MIN_KHZ_BITS   _u(0x01ffffff)
#define CLOCKS_FC0_MIN_KHZ_RESET  _u(0x00000000)
#define CLOCKS_FC0_MIN_KHZ_MSB    _u(24)
#define CLOCKS_FC0_MIN_KHZ_LSB    _u(0)
#define CLOCKS_FC0_MIN_KHZ_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_FC0_MAX_KHZ
// Description : Maximum pass frequency in kHz. This is optional. Set to
//               0x1ffffff if you are not using the pass/fail flags
#define CLOCKS_FC0_MAX_KHZ_OFFSET _u(0x00000094)
#define CLOCKS_FC0_MAX_KHZ_BITS   _u(0x01ffffff)
#define CLOCKS_FC0_MAX_KHZ_RESET  _u(0x01ffffff)
#define CLOCKS_FC0_MAX_KHZ_MSB    _u(24)
#define CLOCKS_FC0_MAX_KHZ_LSB    _u(0)
#define CLOCKS_FC0_MAX_KHZ_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_FC0_DELAY
// Description : Delays the start of frequency counting to allow the mux to
//               settle
//               Delay is measured in multiples of the reference clock period
#define CLOCKS_FC0_DELAY_OFFSET _u(0x00000098)
#define CLOCKS_FC0_DELAY_BITS   _u(0x00000007)
#define CLOCKS_FC0_DELAY_RESET  _u(0x00000001)
#define CLOCKS_FC0_DELAY_MSB    _u(2)
#define CLOCKS_FC0_DELAY_LSB    _u(0)
#define CLOCKS_FC0_DELAY_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_FC0_INTERVAL
// Description : The test interval is 0.98us * 2**interval, but let's call it
//               1us * 2**interval
//               The default gives a test interval of 250us
#define CLOCKS_FC0_INTERVAL_OFFSET _u(0x0000009c)
#define CLOCKS_FC0_INTERVAL_BITS   _u(0x0000000f)
#define CLOCKS_FC0_INTERVAL_RESET  _u(0x00000008)
#define CLOCKS_FC0_INTERVAL_MSB    _u(3)
#define CLOCKS_FC0_INTERVAL_LSB    _u(0)
#define CLOCKS_FC0_INTERVAL_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_FC0_SRC
// Description : Clock sent to frequency counter, set to 0 when not required
//               Writing to this register initiates the frequency count
//               0x00 -> NULL
//               0x01 -> pll_sys_clksrc_primary
//               0x02 -> pll_usb_clksrc_primary
//               0x03 -> rosc_clksrc
//               0x04 -> rosc_clksrc_ph
//               0x05 -> xosc_clksrc
//               0x06 -> clksrc_gpin0
//               0x07 -> clksrc_gpin1
//               0x08 -> clk_ref
//               0x09 -> clk_sys
//               0x0a -> clk_peri
//               0x0b -> clk_usb
//               0x0c -> clk_adc
//               0x0d -> clk_hstx
//               0x0e -> lposc_clksrc
//               0x0f -> otp_clk2fc
//               0x10 -> pll_usb_clksrc_primary_dft
#define CLOCKS_FC0_SRC_OFFSET _u(0x000000a0)
#define CLOCKS_FC0_SRC_BITS   _u(0x000000ff)
#define CLOCKS_FC0_SRC_RESET  _u(0x00000000)
#define CLOCKS_FC0_SRC_MSB    _u(7)
#define CLOCKS_FC0_SRC_LSB    _u(0)
#define CLOCKS_FC0_SRC_ACCESS "RW"
#define CLOCKS_FC0_SRC_VALUE_NULL _u(0x00)
#define CLOCKS_FC0_SRC_VALUE_PLL_SYS_CLKSRC_PRIMARY _u(0x01)
#define CLOCKS_FC0_SRC_VALUE_PLL_USB_CLKSRC_PRIMARY _u(0x02)
#define CLOCKS_FC0_SRC_VALUE_ROSC_CLKSRC _u(0x03)
#define CLOCKS_FC0_SRC_VALUE_ROSC_CLKSRC_PH _u(0x04)
#define CLOCKS_FC0_SRC_VALUE_XOSC_CLKSRC _u(0x05)
#define CLOCKS_FC0_SRC_VALUE_CLKSRC_GPIN0 _u(0x06)
#define CLOCKS_FC0_SRC_VALUE_CLKSRC_GPIN1 _u(0x07)
#define CLOCKS_FC0_SRC_VALUE_CLK_REF _u(0x08)
#define CLOCKS_FC0_SRC_VALUE_CLK_SYS _u(0x09)
#define CLOCKS_FC0_SRC_VALUE_CLK_PERI _u(0x0a)
#define CLOCKS_FC0_SRC_VALUE_CLK_USB _u(0x0b)
#define CLOCKS_FC0_SRC_VALUE_CLK_ADC _u(0x0c)
#define CLOCKS_FC0_SRC_VALUE_CLK_HSTX _u(0x0d)
#define CLOCKS_FC0_SRC_VALUE_LPOSC_CLKSRC _u(0x0e)
#define CLOCKS_FC0_SRC_VALUE_OTP_CLK2FC _u(0x0f)
#define CLOCKS_FC0_SRC_VALUE_PLL_USB_CLKSRC_PRIMARY_DFT _u(0x10)
// =============================================================================
// Register    : CLOCKS_FC0_STATUS
// Description : Frequency counter status
#define CLOCKS_FC0_STATUS_OFFSET _u(0x000000a4)
#define CLOCKS_FC0_STATUS_BITS   _u(0x11111111)
#define CLOCKS_FC0_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_STATUS_DIED
// Description : Test clock stopped during test
#define CLOCKS_FC0_STATUS_DIED_RESET  _u(0x0)
#define CLOCKS_FC0_STATUS_DIED_BITS   _u(0x10000000)
#define CLOCKS_FC0_STATUS_DIED_MSB    _u(28)
#define CLOCKS_FC0_STATUS_DIED_LSB    _u(28)
#define CLOCKS_FC0_STATUS_DIED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_STATUS_FAST
// Description : Test clock faster than expected, only valid when status_done=1
#define CLOCKS_FC0_STATUS_FAST_RESET  _u(0x0)
#define CLOCKS_FC0_STATUS_FAST_BITS   _u(0x01000000)
#define CLOCKS_FC0_STATUS_FAST_MSB    _u(24)
#define CLOCKS_FC0_STATUS_FAST_LSB    _u(24)
#define CLOCKS_FC0_STATUS_FAST_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_STATUS_SLOW
// Description : Test clock slower than expected, only valid when status_done=1
#define CLOCKS_FC0_STATUS_SLOW_RESET  _u(0x0)
#define CLOCKS_FC0_STATUS_SLOW_BITS   _u(0x00100000)
#define CLOCKS_FC0_STATUS_SLOW_MSB    _u(20)
#define CLOCKS_FC0_STATUS_SLOW_LSB    _u(20)
#define CLOCKS_FC0_STATUS_SLOW_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_STATUS_FAIL
// Description : Test failed
#define CLOCKS_FC0_STATUS_FAIL_RESET  _u(0x0)
#define CLOCKS_FC0_STATUS_FAIL_BITS   _u(0x00010000)
#define CLOCKS_FC0_STATUS_FAIL_MSB    _u(16)
#define CLOCKS_FC0_STATUS_FAIL_LSB    _u(16)
#define CLOCKS_FC0_STATUS_FAIL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_STATUS_WAITING
// Description : Waiting for test clock to start
#define CLOCKS_FC0_STATUS_WAITING_RESET  _u(0x0)
#define CLOCKS_FC0_STATUS_WAITING_BITS   _u(0x00001000)
#define CLOCKS_FC0_STATUS_WAITING_MSB    _u(12)
#define CLOCKS_FC0_STATUS_WAITING_LSB    _u(12)
#define CLOCKS_FC0_STATUS_WAITING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_STATUS_RUNNING
// Description : Test running
#define CLOCKS_FC0_STATUS_RUNNING_RESET  _u(0x0)
#define CLOCKS_FC0_STATUS_RUNNING_BITS   _u(0x00000100)
#define CLOCKS_FC0_STATUS_RUNNING_MSB    _u(8)
#define CLOCKS_FC0_STATUS_RUNNING_LSB    _u(8)
#define CLOCKS_FC0_STATUS_RUNNING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_STATUS_DONE
// Description : Test complete
#define CLOCKS_FC0_STATUS_DONE_RESET  _u(0x0)
#define CLOCKS_FC0_STATUS_DONE_BITS   _u(0x00000010)
#define CLOCKS_FC0_STATUS_DONE_MSB    _u(4)
#define CLOCKS_FC0_STATUS_DONE_LSB    _u(4)
#define CLOCKS_FC0_STATUS_DONE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_STATUS_PASS
// Description : Test passed
#define CLOCKS_FC0_STATUS_PASS_RESET  _u(0x0)
#define CLOCKS_FC0_STATUS_PASS_BITS   _u(0x00000001)
#define CLOCKS_FC0_STATUS_PASS_MSB    _u(0)
#define CLOCKS_FC0_STATUS_PASS_LSB    _u(0)
#define CLOCKS_FC0_STATUS_PASS_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_FC0_RESULT
