Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/clocks.h
// Description : Result of frequency measurement, only valid when status_done=1
#define CLOCKS_FC0_RESULT_OFFSET _u(0x000000a8)
#define CLOCKS_FC0_RESULT_BITS   _u(0x3fffffff)
#define CLOCKS_FC0_RESULT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_RESULT_KHZ
#define CLOCKS_FC0_RESULT_KHZ_RESET  _u(0x0000000)
#define CLOCKS_FC0_RESULT_KHZ_BITS   _u(0x3fffffe0)
#define CLOCKS_FC0_RESULT_KHZ_MSB    _u(29)
#define CLOCKS_FC0_RESULT_KHZ_LSB    _u(5)
#define CLOCKS_FC0_RESULT_KHZ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_FC0_RESULT_FRAC
#define CLOCKS_FC0_RESULT_FRAC_RESET  _u(0x00)
#define CLOCKS_FC0_RESULT_FRAC_BITS   _u(0x0000001f)
#define CLOCKS_FC0_RESULT_FRAC_MSB    _u(4)
#define CLOCKS_FC0_RESULT_FRAC_LSB    _u(0)
#define CLOCKS_FC0_RESULT_FRAC_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_WAKE_EN0
// Description : enable clock in wake mode
#define CLOCKS_WAKE_EN0_OFFSET _u(0x000000ac)
#define CLOCKS_WAKE_EN0_BITS   _u(0xffffffff)
#define CLOCKS_WAKE_EN0_RESET  _u(0xffffffff)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_SIO
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_BITS   _u(0x80000000)
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_MSB    _u(31)
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_LSB    _u(31)
#define CLOCKS_WAKE_EN0_CLK_SYS_SIO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_SHA256
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_BITS   _u(0x40000000)
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_MSB    _u(30)
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_LSB    _u(30)
#define CLOCKS_WAKE_EN0_CLK_SYS_SHA256_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_PSM
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_BITS   _u(0x20000000)
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_MSB    _u(29)
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_LSB    _u(29)
#define CLOCKS_WAKE_EN0_CLK_SYS_PSM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_ROSC
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_BITS   _u(0x10000000)
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_MSB    _u(28)
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_LSB    _u(28)
#define CLOCKS_WAKE_EN0_CLK_SYS_ROSC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_ROM
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_BITS   _u(0x08000000)
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_MSB    _u(27)
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_LSB    _u(27)
#define CLOCKS_WAKE_EN0_CLK_SYS_ROM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_RESETS
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_BITS   _u(0x04000000)
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_MSB    _u(26)
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_LSB    _u(26)
#define CLOCKS_WAKE_EN0_CLK_SYS_RESETS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_PWM
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_BITS   _u(0x02000000)
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_MSB    _u(25)
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_LSB    _u(25)
#define CLOCKS_WAKE_EN0_CLK_SYS_PWM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_POWMAN
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_BITS   _u(0x01000000)
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_MSB    _u(24)
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_LSB    _u(24)
#define CLOCKS_WAKE_EN0_CLK_SYS_POWMAN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_REF_POWMAN
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_BITS   _u(0x00800000)
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_MSB    _u(23)
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_LSB    _u(23)
#define CLOCKS_WAKE_EN0_CLK_REF_POWMAN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_BITS   _u(0x00400000)
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_MSB    _u(22)
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_LSB    _u(22)
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_USB_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_BITS   _u(0x00200000)
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_MSB    _u(21)
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_LSB    _u(21)
#define CLOCKS_WAKE_EN0_CLK_SYS_PLL_SYS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_PIO2
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_BITS   _u(0x00100000)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_MSB    _u(20)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_LSB    _u(20)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_PIO1
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_BITS   _u(0x00080000)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_MSB    _u(19)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_LSB    _u(19)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_PIO0
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_BITS   _u(0x00040000)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_MSB    _u(18)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_LSB    _u(18)
#define CLOCKS_WAKE_EN0_CLK_SYS_PIO0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_PADS
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_BITS   _u(0x00020000)
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_MSB    _u(17)
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_LSB    _u(17)
#define CLOCKS_WAKE_EN0_CLK_SYS_PADS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_OTP
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_BITS   _u(0x00010000)
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_MSB    _u(16)
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_LSB    _u(16)
#define CLOCKS_WAKE_EN0_CLK_SYS_OTP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_REF_OTP
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_BITS   _u(0x00008000)
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_MSB    _u(15)
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_LSB    _u(15)
#define CLOCKS_WAKE_EN0_CLK_REF_OTP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_JTAG
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_BITS   _u(0x00004000)
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_MSB    _u(14)
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_LSB    _u(14)
#define CLOCKS_WAKE_EN0_CLK_SYS_JTAG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_IO
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_BITS   _u(0x00002000)
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_MSB    _u(13)
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_LSB    _u(13)
#define CLOCKS_WAKE_EN0_CLK_SYS_IO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_I2C1
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_BITS   _u(0x00001000)
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_MSB    _u(12)
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_LSB    _u(12)
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_I2C0
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_BITS   _u(0x00000800)
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_MSB    _u(11)
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_LSB    _u(11)
#define CLOCKS_WAKE_EN0_CLK_SYS_I2C0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_HSTX
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_BITS   _u(0x00000400)
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_MSB    _u(10)
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_LSB    _u(10)
#define CLOCKS_WAKE_EN0_CLK_SYS_HSTX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_HSTX
#define CLOCKS_WAKE_EN0_CLK_HSTX_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_HSTX_BITS   _u(0x00000200)
#define CLOCKS_WAKE_EN0_CLK_HSTX_MSB    _u(9)
#define CLOCKS_WAKE_EN0_CLK_HSTX_LSB    _u(9)
#define CLOCKS_WAKE_EN0_CLK_HSTX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_BITS   _u(0x00000100)
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_MSB    _u(8)
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_LSB    _u(8)
#define CLOCKS_WAKE_EN0_CLK_SYS_GLITCH_DETECTOR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_DMA
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_BITS   _u(0x00000080)
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_MSB    _u(7)
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_LSB    _u(7)
#define CLOCKS_WAKE_EN0_CLK_SYS_DMA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_BITS   _u(0x00000040)
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_MSB    _u(6)
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_LSB    _u(6)
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSFABRIC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_BITS   _u(0x00000020)
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_MSB    _u(5)
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_LSB    _u(5)
#define CLOCKS_WAKE_EN0_CLK_SYS_BUSCTRL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_BITS   _u(0x00000010)
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_MSB    _u(4)
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_LSB    _u(4)
#define CLOCKS_WAKE_EN0_CLK_SYS_BOOTRAM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_ADC
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_BITS   _u(0x00000008)
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_MSB    _u(3)
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_LSB    _u(3)
#define CLOCKS_WAKE_EN0_CLK_SYS_ADC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_ADC
#define CLOCKS_WAKE_EN0_CLK_ADC_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_ADC_BITS   _u(0x00000004)
#define CLOCKS_WAKE_EN0_CLK_ADC_MSB    _u(2)
#define CLOCKS_WAKE_EN0_CLK_ADC_LSB    _u(2)
#define CLOCKS_WAKE_EN0_CLK_ADC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_BITS   _u(0x00000002)
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_MSB    _u(1)
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_LSB    _u(1)
#define CLOCKS_WAKE_EN0_CLK_SYS_ACCESSCTRL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_RESET  _u(0x1)
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_BITS   _u(0x00000001)
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_MSB    _u(0)
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_LSB    _u(0)
#define CLOCKS_WAKE_EN0_CLK_SYS_CLOCKS_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_WAKE_EN1
// Description : enable clock in wake mode
#define CLOCKS_WAKE_EN1_OFFSET _u(0x000000b0)
#define CLOCKS_WAKE_EN1_BITS   _u(0x7fffffff)
#define CLOCKS_WAKE_EN1_RESET  _u(0x7fffffff)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_XOSC
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_BITS   _u(0x40000000)
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_MSB    _u(30)
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_LSB    _u(30)
#define CLOCKS_WAKE_EN1_CLK_SYS_XOSC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_XIP
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_BITS   _u(0x20000000)
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_MSB    _u(29)
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_LSB    _u(29)
#define CLOCKS_WAKE_EN1_CLK_SYS_XIP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_BITS   _u(0x10000000)
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_MSB    _u(28)
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_LSB    _u(28)
#define CLOCKS_WAKE_EN1_CLK_SYS_WATCHDOG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_USB
#define CLOCKS_WAKE_EN1_CLK_USB_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_USB_BITS   _u(0x08000000)
#define CLOCKS_WAKE_EN1_CLK_USB_MSB    _u(27)
#define CLOCKS_WAKE_EN1_CLK_USB_LSB    _u(27)
#define CLOCKS_WAKE_EN1_CLK_USB_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_BITS   _u(0x04000000)
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_MSB    _u(26)
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_LSB    _u(26)
#define CLOCKS_WAKE_EN1_CLK_SYS_USBCTRL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_UART1
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_BITS   _u(0x02000000)
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_MSB    _u(25)
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_LSB    _u(25)
#define CLOCKS_WAKE_EN1_CLK_SYS_UART1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_PERI_UART1
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_BITS   _u(0x01000000)
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_MSB    _u(24)
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_LSB    _u(24)
#define CLOCKS_WAKE_EN1_CLK_PERI_UART1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_UART0
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_BITS   _u(0x00800000)
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_MSB    _u(23)
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_LSB    _u(23)
#define CLOCKS_WAKE_EN1_CLK_SYS_UART0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_PERI_UART0
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_BITS   _u(0x00400000)
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_MSB    _u(22)
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_LSB    _u(22)
#define CLOCKS_WAKE_EN1_CLK_PERI_UART0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_TRNG
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_BITS   _u(0x00200000)
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_MSB    _u(21)
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_LSB    _u(21)
#define CLOCKS_WAKE_EN1_CLK_SYS_TRNG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_TIMER1
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_BITS   _u(0x00100000)
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_MSB    _u(20)
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_LSB    _u(20)
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_TIMER0
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_BITS   _u(0x00080000)
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_MSB    _u(19)
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_LSB    _u(19)
#define CLOCKS_WAKE_EN1_CLK_SYS_TIMER0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_TICKS
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_BITS   _u(0x00040000)
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_MSB    _u(18)
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_LSB    _u(18)
#define CLOCKS_WAKE_EN1_CLK_SYS_TICKS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_REF_TICKS
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_BITS   _u(0x00020000)
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_MSB    _u(17)
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_LSB    _u(17)
#define CLOCKS_WAKE_EN1_CLK_REF_TICKS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_TBMAN
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_BITS   _u(0x00010000)
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_MSB    _u(16)
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_LSB    _u(16)
#define CLOCKS_WAKE_EN1_CLK_SYS_TBMAN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_BITS   _u(0x00008000)
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_MSB    _u(15)
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_LSB    _u(15)
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSINFO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_BITS   _u(0x00004000)
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_MSB    _u(14)
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_LSB    _u(14)
#define CLOCKS_WAKE_EN1_CLK_SYS_SYSCFG_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SRAM9
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_BITS   _u(0x00002000)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_MSB    _u(13)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_LSB    _u(13)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM9_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SRAM8
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_BITS   _u(0x00001000)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_MSB    _u(12)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_LSB    _u(12)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM8_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SRAM7
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_BITS   _u(0x00000800)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_MSB    _u(11)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_LSB    _u(11)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM7_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SRAM6
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_BITS   _u(0x00000400)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_MSB    _u(10)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_LSB    _u(10)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM6_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SRAM5
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_BITS   _u(0x00000200)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_MSB    _u(9)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_LSB    _u(9)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM5_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SRAM4
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_BITS   _u(0x00000100)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_MSB    _u(8)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_LSB    _u(8)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM4_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SRAM3
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_BITS   _u(0x00000080)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_MSB    _u(7)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_LSB    _u(7)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_WAKE_EN1_CLK_SYS_SRAM2
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_RESET  _u(0x1)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_BITS   _u(0x00000040)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_MSB    _u(6)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_LSB    _u(6)
#define CLOCKS_WAKE_EN1_CLK_SYS_SRAM2_ACCESS "RW"
