Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/clocks.h
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_LSB    _u(14)
#define CLOCKS_ENABLED1_CLK_SYS_SYSCFG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM9
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_BITS   _u(0x00002000)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_MSB    _u(13)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_LSB    _u(13)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM9_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM8
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_BITS   _u(0x00001000)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_MSB    _u(12)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_LSB    _u(12)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM8_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM7
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_BITS   _u(0x00000800)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_MSB    _u(11)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_LSB    _u(11)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM7_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM6
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_BITS   _u(0x00000400)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_MSB    _u(10)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_LSB    _u(10)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM6_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM5
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_BITS   _u(0x00000200)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_MSB    _u(9)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_LSB    _u(9)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM5_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM4
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_BITS   _u(0x00000100)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_MSB    _u(8)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_LSB    _u(8)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM4_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM3
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_BITS   _u(0x00000080)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_MSB    _u(7)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_LSB    _u(7)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM3_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM2
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_BITS   _u(0x00000040)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_MSB    _u(6)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_LSB    _u(6)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM1
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_BITS   _u(0x00000020)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_MSB    _u(5)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_LSB    _u(5)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SRAM0
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_BITS   _u(0x00000010)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_MSB    _u(4)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_LSB    _u(4)
#define CLOCKS_ENABLED1_CLK_SYS_SRAM0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SPI1
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_BITS   _u(0x00000008)
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_MSB    _u(3)
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_LSB    _u(3)
#define CLOCKS_ENABLED1_CLK_SYS_SPI1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_PERI_SPI1
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_BITS   _u(0x00000004)
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_MSB    _u(2)
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_LSB    _u(2)
#define CLOCKS_ENABLED1_CLK_PERI_SPI1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_SYS_SPI0
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_BITS   _u(0x00000002)
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_MSB    _u(1)
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_LSB    _u(1)
#define CLOCKS_ENABLED1_CLK_SYS_SPI0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : CLOCKS_ENABLED1_CLK_PERI_SPI0
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_RESET  _u(0x0)
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_BITS   _u(0x00000001)
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_MSB    _u(0)
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_LSB    _u(0)
#define CLOCKS_ENABLED1_CLK_PERI_SPI0_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_INTR
// Description : Raw Interrupts
#define CLOCKS_INTR_OFFSET _u(0x000000c4)
#define CLOCKS_INTR_BITS   _u(0x00000001)
#define CLOCKS_INTR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_INTR_CLK_SYS_RESUS
#define CLOCKS_INTR_CLK_SYS_RESUS_RESET  _u(0x0)
#define CLOCKS_INTR_CLK_SYS_RESUS_BITS   _u(0x00000001)
#define CLOCKS_INTR_CLK_SYS_RESUS_MSB    _u(0)
#define CLOCKS_INTR_CLK_SYS_RESUS_LSB    _u(0)
#define CLOCKS_INTR_CLK_SYS_RESUS_ACCESS "RO"
// =============================================================================
// Register    : CLOCKS_INTE
// Description : Interrupt Enable
#define CLOCKS_INTE_OFFSET _u(0x000000c8)
#define CLOCKS_INTE_BITS   _u(0x00000001)
#define CLOCKS_INTE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_INTE_CLK_SYS_RESUS
#define CLOCKS_INTE_CLK_SYS_RESUS_RESET  _u(0x0)
#define CLOCKS_INTE_CLK_SYS_RESUS_BITS   _u(0x00000001)
#define CLOCKS_INTE_CLK_SYS_RESUS_MSB    _u(0)
#define CLOCKS_INTE_CLK_SYS_RESUS_LSB    _u(0)
#define CLOCKS_INTE_CLK_SYS_RESUS_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_INTF
// Description : Interrupt Force
#define CLOCKS_INTF_OFFSET _u(0x000000cc)
#define CLOCKS_INTF_BITS   _u(0x00000001)
#define CLOCKS_INTF_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_INTF_CLK_SYS_RESUS
#define CLOCKS_INTF_CLK_SYS_RESUS_RESET  _u(0x0)
#define CLOCKS_INTF_CLK_SYS_RESUS_BITS   _u(0x00000001)
#define CLOCKS_INTF_CLK_SYS_RESUS_MSB    _u(0)
#define CLOCKS_INTF_CLK_SYS_RESUS_LSB    _u(0)
#define CLOCKS_INTF_CLK_SYS_RESUS_ACCESS "RW"
// =============================================================================
// Register    : CLOCKS_INTS
// Description : Interrupt status after masking & forcing
#define CLOCKS_INTS_OFFSET _u(0x000000d0)
#define CLOCKS_INTS_BITS   _u(0x00000001)
#define CLOCKS_INTS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : CLOCKS_INTS_CLK_SYS_RESUS
#define CLOCKS_INTS_CLK_SYS_RESUS_RESET  _u(0x0)
#define CLOCKS_INTS_CLK_SYS_RESUS_BITS   _u(0x00000001)
#define CLOCKS_INTS_CLK_SYS_RESUS_MSB    _u(0)
#define CLOCKS_INTS_CLK_SYS_RESUS_LSB    _u(0)
#define CLOCKS_INTS_CLK_SYS_RESUS_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_CLOCKS_H

